package sample;

class March20th {

	public static void main(String[] args) {

		//四則演算等、インクリメント （8項目）
		//引数、乱数（２行）
		//データ型、代入、キャス（１１行）
		//エスケープシーケンス(８個)
		//関係演算子（６個）
		//if文
		//条件演算子(３項演算子）
		//論理演算子（４種）優先順位
		//for文
		//switch文
		//Scanner(数値、文字）
		//for文
		//while文
		//do-while文
		//複数ループ(コンティニュー)
		//複数ループ（ブレイク)
		//ラベル
		//配列（書き方１）
		//拡張for文
		//配列（書き方２、３）
		//メソッドの呼び出し
		//クラスの作成・呼び出し（フィールド、メソッド）
		//引数なしコンストラクタ作成、引数ありコンストラクタ作成
		//コンストラクトの実行（オーバーロード）※メソッドも動きは同じ
		//＊static修飾子
		//＊イニシャライザ、定数
		//＊アクセス修飾子
		//セッタとゲッタ
		//Bigdecimal(半径計算）
		//Dateクラス(現在の月日データ、時間の表示)
		//Calendarクラス(現在の月の表示、日の表示)
		//SimpleDateFormatクラス(年月日時間の表示、年月日の表示)
		//Stringクラス（char1,int3,boolean4,String6,String[]1）
		//StringBuilderメソッド
		//ラッパークラスの変換（５種）
		//ラッパークラスの定数（５種）
		//＊オートボクシング
		//DecimalFormat（５種）
		//try-catch-finally、スタックトレース表示、補足コメントのみ表示
		//例外の自己スロー（同義２種）
		//＊Thread、チェック例外、非チェック例外
		//スキャナークラス(boolean3,int1,String2)、繰り返し入力、再入力
		//１．４以前のコンソール入力
		//書式付き出力、変換文字、フラグ、引数番号、
		//可変長引数
		//簡易printf実行メソッド
		//継承、処理の追加、メソッドのオーバーライド、super、継承の禁止
		//継承とコンストラクタ、継承されないもの
		//instanceof演算子
		//interface(のルール)、実装、複数のインターフェース、インターフェースの継承
		//抽象クラス、型変換、（static）親子シャドウ変数メンバ、ポリモーフィズムとは
		//例外の種類、例外の作成、原因例外、キャッチの順序
		//アサーション（通常は実行しても表示されない）
		//＊ネストクラス
		//列挙型
		//コレクション：List、型引数の指定(ジェネリックス)、自作クラスの型引数、Listの拡張for
		//コレクション：Set、ユニークな値、順番は不保持、再セット不可はfalse
		//コレクション：Map、要素の一覧、
		//Iterator(List・Set)
		//＊Vector Hashtable Enumeration
		//配列⇔List
		//Collectionsクラスのソート、ソートのカスタマイズ（ソート３種類）
		//
	}
		//メソッドの基本、メソッドの戻り値
		//可変長引数メソッド
}